Revit 2016 API
MassLevelData Properties
The MassLevelData type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ConceptualConstructionId
 The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
ConceptualConstructionIsByEnergyData
 Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized with the EnergyDataSettings or if it overrides those settings.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaterialId
 The ElementId of the visualization material used for the MassLevelData (Mass Floor)
MaterialType
 Indicates if the material used for the graphical appearance is by category or a specific material, or if the material to be used should be taken from the ConceptualConstructionType of the MassLevelData.
Name
A human readable name for the Element.
 (Inherited from Element.)
NExteriorSurfaceArea
 The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
NLevelFafArea
 The surface area of the intersection of the MassLevelData's level with the mass geometry.
NLevelPerimeter
 The perimeter of the intersection of the MassLevelData's level with the mass geometry.
NVolume
 The volume of from the level of this MassLevelData (Mass Floor) to the next in the mass.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
OwningMassId
 The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
StrUsage
 A String which describes the usage or occupancy type of the level of the MassLevelData.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace